In [1]:
#useful resource: #chrisalbon.com

import pandas as pd

In [2]:
#create dataframe from csv

salaries = pd.read_csv('salaries.csv')

In [ ]:
########################
### LOOK AT THE DATA ###
########################

In [3]:
salaries.head() #first 5 observations

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,$101442.00,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,$94122.00,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,$101592.00,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,$110064.00,NaN
4,"ABARCA, EMMANUEL",CONCRETE LABORER,TRANSPORTN,F,Hourly,40.0,NaN,$36.18

In [5]:
salaries.head(2) #first 2 observations

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,$101442.00,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,$94122.00,NaN

In [6]:
salaries.shape#how many rows and columns?

(32812, 8)

In [9]:
salaries.tail()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
32807,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,$72510.00,NaN
32808,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN
32809,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN
32810,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,$93354.00,NaN
32811,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,$115932.00,NaN

In [7]:
salaries.columns #what are the columns?

Index(['Name', 'Job Titles', 'Department', 'Full or Part-Time',
       'Salary or Hourly', 'Typical Hours', 'Annual Salary', 'Hourly Rate'],
      dtype='object')

In [8]:
salaries['Department'].unique() #view unique values in a column

array(['POLICE', 'GENERAL SERVICES', 'WATER MGMNT', 'TRANSPORTN', 'OEMC',
       'CITY COUNCIL', 'AVIATION', 'STREETS & SAN', 'FIRE',
       'FAMILY & SUPPORT', 'PUBLIC LIBRARY', "MAYOR'S OFFICE", 'HEALTH',
       'BUSINESS AFFAIRS', 'LAW', 'FINANCE', 'CULTURAL AFFAIRS',
       'COMMUNITY DEVELOPMENT', 'PROCUREMENT', 'BUILDINGS',
       'ANIMAL CONTRL', 'CITY CLERK', 'BOARD OF ELECTION', 'DISABILITIES',
       'HUMAN RESOURCES', 'DoIT', 'BUDGET & MGMT', 'TREASURER',
       'INSPECTOR GEN', 'IPRA', 'HUMAN RELATIONS', 'COPA',
       'BOARD OF ETHICS', 'POLICE BOARD', 'ADMIN HEARNG',
       'LICENSE APPL COMM'], dtype=object)

In [ ]:
###############################
### SELECT ROWS AND COLUMNS ###
###############################

In [10]:
salaries['Job Titles'].head() #select a column - series!

0                                  SERGEANT
1    POLICE OFFICER (ASSIGNED AS DETECTIVE)
2                  CHIEF CONTRACT EXPEDITER
3                         CIVIL ENGINEER IV
4                          CONCRETE LABORER
Name: Job Titles, dtype: object

In [11]:
salaries[['Name', 'Job Titles']].head() #select multiple columns - dataframe!

                  Name                              Job Titles
0    AARON,  JEFFERY M                                SERGEANT
1      AARON,  KARINA   POLICE OFFICER (ASSIGNED AS DETECTIVE)
2  AARON,  KIMBERLEI R                CHIEF CONTRACT EXPEDITER
3  ABAD JR,  VICENTE M                       CIVIL ENGINEER IV
4   ABARCA,  EMMANUEL                         CONCRETE LABORER

In [12]:
salaries.iloc[25:27] #select rows by row number

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
25,"ABERCROMBIE IV, EARL S",PARAMEDIC I/C,FIRE,F,Salary,NaN,$82614.00,NaN
26,"ABERCROMBIE, TIMOTHY",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,$35.60

In [13]:
salaries['Annual Salary'].iloc[50:52] #combine column and row selection

50    $84420.00
51    $76266.00
Name: Annual Salary, dtype: object

In [ ]:
#more on indexing: https://chrisalbon.com/python/pandas_index_select_and_filter.html

In [ ]:
###############
### MASKING ###
###############

#select a subset of the dataframe based on some conditional statement, 
#e.g. select rows for part-time employees

In [14]:
mask = salaries['Full or Part-Time'] == 'P'
salaries[mask].head(n=3)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
5,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,$19.86
11,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,NaN,$2.65
20,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,$17.68

In [15]:
mask

0        False
1        False
2        False
3        False
4        False
5         True
6        False
7        False
8        False
9        False
10       False
11        True
12       False
13       False
14       False
15       False
16       False
17       False
18       False
19       False
20        True
21       False
22       False
23       False
24       False
25       False
26       False
27       False
28        True
29       False
         ...
32782    False
32783    False
32784    False
32785    False
32786    False
32787    False
32788    False
32789    False
32790    False
32791    False
32792    False
32793    False
32794    False
32795    False
32796    False
32797     True
32798    False
32799    False
32800    False
32801    False
32802    False
32803    False
32804    False
32805    False
32806    False
32807    False
32808    False
32809    False
32810    False
32811    False
Name: Full or Part-Time, dtype: bool

In [16]:
salaries[salaries['Full or Part-Time'] == 'P'].head(n=3) #same as above

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
5,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,$19.86
11,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,NaN,$2.65
20,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,$17.68

In [17]:
#or: |

salaries[(salaries['Department'] == 'OEMC') | (salaries['Department'] == 'PUBLIC LIBRARY')].head(n=3)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
5,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,$19.86
20,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,$17.68
28,"ABIOYE, ADEWOLE A",LIBRARY ASSOCIATE - HOURLY,PUBLIC LIBRARY,P,Hourly,20.0,NaN,$25.10

In [18]:
#and: &

salaries[(salaries['Department'] == 'PUBLIC LIBRARY') & (salaries['Full or Part-Time'] == 'F')].head(n=3)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
100,"ACOSTA, MARTHA A",LIBRARY ASSOCIATE,PUBLIC LIBRARY,F,Salary,NaN,$69492.00,NaN
120,"ADAMS, DEANIE M",LIBRARIAN II,PUBLIC LIBRARY,F,Salary,NaN,$65448.00,NaN
156,"ADAMS, SHERYLL A",LIBRARIAN IV,PUBLIC LIBRARY,F,Salary,NaN,$100776.00,NaN

In [ ]:
#not: ~

salaries[~(salaries['Department'] == 'PUBLIC LIBRARY')].head(n=2)

In [ ]:
#same as above

salaries[salaries['Department'] != "PUBLIC LIBRARY"].head(n=2)

In [19]:
###############################
### DEALING WITH DATA TYPES ###
###############################

In [20]:
salaries.dtypes #check types of all columns

Name                  object
Job Titles            object
Department            object
Full or Part-Time     object
Salary or Hourly      object
Typical Hours        float64
Annual Salary         object
Hourly Rate           object
dtype: object

In [21]:
type(salaries['Annual Salary'].iloc[0]) #check type of salary column

str

In [22]:
salaries['Annual Salary'] = salaries['Annual Salary'].str.replace('$', '') #remove dollar signs
salaries['Annual Salary'].head(n=2) #dollar signs are gone

0    101442.00
1     94122.00
Name: Annual Salary, dtype: object

In [23]:
type(salaries['Annual Salary'].iloc[0]) #still a string...

str

In [25]:


salaries['Annual Salary'] = salaries['Annual Salary'].apply(pd.to_numeric) #convert column to float

In [26]:
type(salaries['Annual Salary'].iloc[0]) #float!

numpy.float64

In [27]:
#now we can do math :)

mean_sal = salaries['Annual Salary'].mean() #automatically ignores NaNs
med_sal = salaries['Annual Salary'].median()
min_sal = salaries['Annual Salary'].min()
max_sal = salaries['Annual Salary'].max()
count_sal = salaries['Annual Salary'].count()

print("mean: %s, median: %s, min: %s, max: %s, count: %s" % (mean_sal, med_sal, min_sal, max_sal, count_sal))

mean: 87313.9591872, median: 90024.0, min: 12840.0, max: 300000.0, count: 24951

In [ ]:
####################
### MISSING DATA ###
####################

In [28]:
salaries.isnull().head() #find NaNs

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,False,False,False,False,False,True,False,True
1,False,False,False,False,False,True,False,True
2,False,False,False,False,False,True,False,True
3,False,False,False,False,False,True,False,True
4,False,False,False,False,False,False,True,False

In [29]:
salaries['Annual Salary'].fillna(0).head() #fill NaN with 0 - does this make sense for the data?

0    101442.0
1     94122.0
2    101592.0
3    110064.0
4         0.0
Name: Annual Salary, dtype: float64

In [30]:
salaries = salaries.dropna(thresh=2) #does this make sense for the data?
salaries.shape

(0, 8)

In [31]:
salaries = pd.read_csv('salaries.csv') #remake dataframe

In [32]:
salaries = salaries.dropna(subset = ['Typical Hours']) #drop rows that have NaNs in the Typical Hours column

In [33]:
salaries.shape

(7861, 8)

In [ ]:
###########################
### JOINING AND MERGING ###
###########################

In [34]:
fruit_data = {'id': ['1', '2', '3', '4'],
        'fruit': ['Apple', 'Orange', 'Banana', 'Strawberry']}
df_fruit = pd.DataFrame(fruit_data, columns = ['id', 'fruit']) #if you don't name the columns they'll be in alphabetical order

In [35]:
df_fruit

  id       fruit
0  1       Apple
1  2      Orange
2  3      Banana
3  4  Strawberry

In [36]:
color_data = {'id': ['1', '2', '3', '4'],
        'color': ['Red', 'Orange', 'Yellow', 'Red']}
df_color = pd.DataFrame(color_data, columns = ['id', 'color'])

In [37]:
df_color

  id   color
0  1     Red
1  2  Orange
2  3  Yellow
3  4     Red

In [38]:
pd.merge(df_fruit, df_color, on='id') #merge dataframes

  id       fruit   color
0  1       Apple     Red
1  2      Orange  Orange
2  3      Banana  Yellow
3  4  Strawberry     Red

In [39]:
fruit_data_2 = {'id': ['5', '6'],
                'fruit': ['Raspberry', 'Pineapple']}
df_fruit_2 = pd.DataFrame(fruit_data_2, columns = ['id', 'fruit'])

In [40]:
df_fruit_2

  id      fruit
0  5  Raspberry
1  6  Pineapple

In [41]:
new_fruits = pd.concat([df_fruit, df_fruit_2]) #what's the difference between merge and concat?
new_fruits

  id       fruit
0  1       Apple
1  2      Orange
2  3      Banana
3  4  Strawberry
0  5   Raspberry
1  6   Pineapple

In [47]:
pd.merge(new_fruits, df_color, on='id', how='outer') #why is the color for the last two rows NaN?

  id       fruit   color
0  1       Apple     Red
1  2      Orange  Orange
2  3      Banana  Yellow
3  4  Strawberry     Red
4  5   Raspberry     NaN
5  6   Pineapple     NaN

In [48]:
#http://www.dofactory.com/Images/sql-joins.png
pd.merge(new_fruits, df_color, on='id', how='inner') #raspberry and pineapple get left out because they don't have a match in the colors df

  id       fruit   color
0  1       Apple     Red
1  2      Orange  Orange
2  3      Banana  Yellow
3  4  Strawberry     Red

In [42]:
df_x = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6]})
df_y = pd.DataFrame({'c': [7,8,9], 'd': [10,11,12]}) #what do these dataframes look like?

In [43]:
df_x

   a  b
0  1  4
1  2  5
2  3  6

In [44]:
df_y

   c   d
0  7  10
1  8  11
2  9  12

In [45]:
pd.concat([df_x, df_y], axis=1) #join the dataframes along columns - when would this be useful?

   a  b  c   d
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [46]:
pd.concat([df_x, df_y]) #what will this look like?

     a    b    c     d
0  1.0  4.0  NaN   NaN
1  2.0  5.0  NaN   NaN
2  3.0  6.0  NaN   NaN
0  NaN  NaN  7.0  10.0
1  NaN  NaN  8.0  11.0
2  NaN  NaN  9.0  12.0

In [ ]:
### OTHER HELPFUL FEATURES

In [50]:
salaries.groupby("Department").count().head(n=10)

,Name,Job Titles,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
Department,,,,,,,
ANIMAL CONTRL,18,18,18,18,18,0,18
AVIATION,865,865,865,865,865,0,865
BUDGET & MGMT,2,2,2,2,2,0,2
BUSINESS AFFAIRS,6,6,6,6,6,0,6
CITY CLERK,2,2,2,2,2,0,2
CITY COUNCIL,101,101,101,101,101,0,101
COMMUNITY DEVELOPMENT,3,3,3,3,3,0,3
CULTURAL AFFAIRS,9,9,9,9,9,0,9
DISABILITIES,1,1,1,1,1,0,1
FAMILY & SUPPORT,311,311,311,311,311,0,311

In [51]:
salaries = pd.read_csv('salaries.csv')
salaries['Annual Salary'] = salaries['Annual Salary'].str.replace('$', '')
salaries['Annual Salary'] = salaries['Annual Salary'].apply(pd.to_numeric)

In [53]:
salaries.groupby('Department').median().sort_values("Annual Salary", ascending=False).head()

             Typical Hours  Annual Salary
Department
IPRA                   NaN      101592.00
BUILDINGS              NaN      100256.04
DoIT                   NaN       97056.00
FIRE                  40.0       93666.00
WATER MGMNT           40.0       92556.00

In [54]:
#common mistake: not performing operations in place

salaries.dropna() #performs the operation but doesn't save the results

Empty DataFrame
Columns: [Name, Job Titles, Department, Full or Part-Time, Salary or Hourly, Typical Hours, Annual Salary, Hourly Rate]
Index: []

In [55]:
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABARCA, EMMANUEL",CONCRETE LABORER,TRANSPORTN,F,Hourly,40.0,NaN,$36.18

In [56]:
salaries = salaries.dropna() #or: salaries.dropna(inplace=True)

In [57]:
salaries.head()

Empty DataFrame
Columns: [Name, Job Titles, Department, Full or Part-Time, Salary or Hourly, Typical Hours, Annual Salary, Hourly Rate]
Index: []

In [58]:
salaries = pd.read_csv('salaries.csv') #recreate dataframe

In [59]:
salaries['Typical Hours'].dropna().head() #drop NaNs

4     40.0
5     20.0
7     40.0
8     40.0
11    20.0
Name: Typical Hours, dtype: float64

In [60]:
salaries['Typical Hours'].head() #NaNs are back

0     NaN
1     NaN
2     NaN
3     NaN
4    40.0
Name: Typical Hours, dtype: float64

In [61]:
salaries['Typical Hours'].dropna(inplace=True) #drop NaNs inplace

In [62]:
salaries['Typical Hours'].head() #NaNs are gone

4     40.0
5     20.0
7     40.0
8     40.0
11    20.0
Name: Typical Hours, dtype: float64

In [ ]:
salaries = pd.read_csv('salaries.csv') #recreate dataframe

In [ ]:
(salaries['Typical Hours'] / 10)[:8]

In [ ]:
salaries['Typical Hours'].head() #division by 10 didn't stick

In [ ]:
salaries['Typical Hours'] = salaries['Typical Hours'] / 10

In [ ]:
salaries['Typical Hours'].head(n=5) #division by 10 stuck